test/artillery/artillery.yml
---
config:
  target: http://{{ $processEnvironment.API_HOST }}:{{ $processEnvironment.API_PORT
    }}
  processor: "./artillery.js"
  phases:
  - duration: 30
    arrivalRate: 1
    rampTo: 20
  - duration: 120
    arrivalRate: 20
scenarios:
- name: Admin Login
  flow:
  - function: getAdminCredentials
  - post:
      url: "/api/v1/login"
      beforeRequest: "logRequest"
      afterResponse: "logResponse"
      json:
        email: "{{ adminCredentials.email }}"
        password: "{{ adminCredentials.password }}"
  - loop:
    - function: getPlayerData
    - post:
        url: "/api/v1/players"
        beforeRequest: "logRequest"
        afterResponse: "logResponse"
        json:
          name: "{{ playerData.name }}"
          email: "{{ playerData.email }}"
    - get:
        beforeRequest: "logRequest"
        afterResponse: "logResponse"
        url: "/api/v1/players"
    count: 1000