test/artillery/artillery.yml
config:
  target: "http://{{ $processEnvironment.INCYT_API_HOST }}:{{ $processEnvironment.INCYT_API_PORT }}"
  processor: "./artillery.js"
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 20
    - duration: 120
      arrivalRate: 20
scenarios:
  - name: "Admin Login"
    flow:
      - function: "getAdminCredentials"
      - post:
          url: "/api/v1/login"
          json:
            email: "{{ adminCredentials.email }}"
            password: "{{ adminCredentials.password }}"
      - function: "getPlayerData"
      - post:
          url: "/api/v1/players"
          json:
            name: "{{ playerData.name }}"
            email: "{{ playerData.email }}"
      - get:
          url: "/api/v1/players"